# Brewfile -- declarative list of Homebrew packages for this machine.
# Managed by scripts/brew-sync.sh. Edit this file, then run the script.
#
# Docs: https://github.com/Homebrew/homebrew-bundle

# ---- Taps ----
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "tmuxpack/tpack"

# ---- Formulae (top-level; dependencies are installed automatically) ----
brew "awscli"
brew "azure-cli"
brew "bat"
brew "bc"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glab"
brew "gnu-sed"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "helm"
brew "imagemagick"
brew "jq"
brew "kubectx"
brew "lazygit"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "neovim"
brew "nmap"
brew "nowplaying-cli"
brew "pinentry-mac"
brew "poppler"
brew "python@3.12"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "sshpass"
brew "starship"
brew "stow"
brew "taskwarrior-tui"
brew "tmuxinator"
brew "tree"
brew "tree-sitter-cli"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "wireshark"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ---- Casks ----
cask "caffeine"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace-nf"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "hashicorp-vagrant"
cask "mattermost"
cask "tpack"
cask "virtualbox"
cask "wireshark-app"
