{
  "plugins": {
    "ansible-vim": {
      "src": "https://github.com/pearofducks/ansible-vim"
    },
    "claude-code.nvim": {
      "src": "https://github.com/greggh/claude-code.nvim"
    },
    "fugitive-gitlab.vim": {
      "src": "https://github.com/shumphrey/fugitive-gitlab.vim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "nvim-ansible": {
      "src": "https://github.com/mfussenegger/nvim-ansible"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "startup.nvim": {
      "src": "https://github.com/startup-nvim/startup.nvim"
    },
    "telescope-file-browser.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-file-browser.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-surround": {
      "src": "https://github.com/tpope/vim-surround"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator"
    }
  }
}
